In [1]:
import pandas as pd

In [2]:
dados = {
    'Nome': ['Alice', 'Bob', 'Charlie'],
    'Idade': [24, 30, 22],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte']
}

In [3]:
df = pd.DataFrame(dados) # Data frame te entrega uma tabela bem bonito
df

      Nome  Idade          Cidade
0    Alice     24       São Paulo
1      Bob     30  Rio de Janeiro
2  Charlie     22  Belo Horizonte

In [4]:
# Quer as primeiras linhas?
df.head(2) # Duas primeias linhas

    Nome  Idade          Cidade
0  Alice     24       São Paulo
1    Bob     30  Rio de Janeiro

In [5]:
# Quer pegar a(s) ultima(s) linha(s)?
df.tail(1) # ultima linha
df.tail(2) # Duas ultimas linhas

      Nome  Idade          Cidade
1      Bob     30  Rio de Janeiro
2  Charlie     22  Belo Horizonte

In [7]:
dados_notas = {
    'Nome': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Matemática':[85, 90, 78, 88, 92],
    'Fisica': [80, 75, 88, 85, 95],
    'Química': [78, 82, 85, 80, 88]

}

In [9]:
df_notas = pd.DataFrame(dados_notas) # vai criar uma tabela do dicionário acima
df_notas

      Nome  Matemática  Fisica  Química
0    Alice          85      80       78
1      Bob          90      75       82
2  Charlie          78      88       85
3    David          88      85       80
4      Eva          92      95       88

In [ ]:
# Calcular a media de notas dos alunos
df_notas['Média'] = df_notas[['Matemática', 'Fisica', 'Química']].mean(axis=1) # axis=1 significa que ele esta passando a média ao longo das colunas
df_notas

      Nome  Matemática  Fisica  Química      Média
0    Alice          85      80       78  81.000000
1      Bob          90      75       82  82.333333
2  Charlie          78      88       85  83.666667
3    David          88      85       80  84.333333
4      Eva          92      95       88  91.666667

In [11]:
# Identifica alunos aprovados com notas boas - maior ou igual que a média 82
alunos_aprovados = df_notas[df_notas['Média'] >= 82.5]
alunos_aprovados

      Nome  Matemática  Fisica  Química      Média
2  Charlie          78      88       85  83.666667
3    David          88      85       80  84.333333
4      Eva          92      95       88  91.666667

In [12]:
# Exibir a média e os alunos aprovados
df_notas[['Nome', 'Média']]

      Nome      Média
0    Alice  81.000000
1      Bob  82.333333
2  Charlie  83.666667
3    David  84.333333
4      Eva  91.666667

In [13]:
alunos_aprovados = [['Nome', 'Media']]
alunos_aprovados

[['Nome', 'Media']]